# SQL I

Introducing SQL and databases.

## Starting Up SQL

Before we look at SQL syntax in detail, let's first get ourselves set up to run SQL queries in Jupyter.

#### Approach #1: SQL Magic

**1. Load the `sql` Module.** 

Load `%%sql` cell magic.

In [ ]:
%load_ext sql

**2. Connect to a database.**  

Here, we connect to the SQLite database `basic_examples.db`.

In [ ]:
%%sql
sqlite:///data/basic_examples.db

<br/>

**3. Run a simple SQL query.** 

Note the `%%sql` lets Jupyter parse the rest of the lines as a SQL command.

In [ ]:
%%sql
SELECT * FROM Dragon;

**Simple query, this time on two different lines.**

In [ ]:
%%sql
SELECT *
FROM Dragon;

#### Approach #2: `pd.read_sql`

It turns out that `pandas` has a special-purpose function to parse SQL queries. We can pass in a SQL query as a string to return a `pandas` DataFrame. To achieve the same result as we did using cell magic above, we can do the following.

**1. Connect to a database**

In [ ]:
import sqlalchemy 
import pandas as pd

engine = sqlalchemy.create_engine("sqlite:///data/basic_examples.db")
connection = engine.connect()

**2. Run a simple SQL query**

In [ ]:
query = """
SELECT * 
FROM Dragon;
"""

pd.read_sql(query, engine)

## Tables and Schema

A **database** contains a collection of SQL **tables**. Let's connect to our "toy" database `basic_examples.db` and explore the tables it stores.

In [ ]:
%%sql
sqlite:///data/basic_examples.db

In [ ]:
%%sql
SELECT * FROM sqlite_master WHERE type='table'

## Basic Queries

Every SQL query *must* contain a `SELECT` and `FROM` clause.

* `SELECT`: specify the column(s) to return in the output
* `FROM`: specify the database table from which to extract data

**Question:** Select all columns from the **Dragon** table.

**Question:** Select columns **cute** and **year** from the **Dragon** table.

**Aliasing** with `AS`

**Question:** Repeat the last exercise with aliasing.

**Uniqueness** with `DISTINCT`

**Question:** Select all the unique years in the **Dragon** table.

**Filtering** with `WHERE`

**Question:** Select the **name** and **year** columns from the **Dragon** table such that the cute value is greater than 0.

**Question:** Select the **name**, **cute** and **year** columns from the **Dragon** table such that the cute value is greater than 0 or the year is greater than 2013.

**Question:** Select the **name** and **year** columns from the **Dragon** table such that the name is either 'puff' or 'hiccup'.

**Question:** Get the name and cute value of all dragons whose cute value is not null.

**Ordering** data using `ORDER BY`

**Question:** Sort the **Dragon** table in descending order of cuteness.

**Restricting** output with `LIMIT` and `OFFSET`

**Question:** Query the first two rows of the **Dragon** table.

**Question:** Query the two rows after the first row of the **Dragon** table.

## Grouping Data with `GROUP BY`

**Question:** Get all rows and columns of the **Dish** table.

A small note: the fact that `type` is highlighted in green below is a consequence of Jupyter assuming that we are writing Python code (where `type` is a built-in keyword). `type` does *not* have a special meaning in SQL, so the color below does not indicate any special functionality. When we run the cell, Jupyter realizes it should recognize the code as SQL.

**Question:** Select the **type** column of the **Dish** table.

**Question:** Get all the dish types using GROUP BY.

**Question:** Query the total cost of each type of dish.

**Question:** Query the total cost, the minimum cost and the name of the most expensive dish of each type.

**Question:** Count the number of rows in each year in the **Dragon** table.

**Question:** Count the number of rows - including the rows with NULLs - in each year in the **Dragon** table.